Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/v2/Resources/ConsultaPuntosLealtad/wsdl/consultaPuntosLealtadPS.wsdl

<wsdl:definitions targetNamespace="http://www.ficohsa.com.hn/middleware.services/programaLealtad/" name="consultaPuntosLealtadPS" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/programaLealtad/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:pro="http://www.ficohsa.com.hn/middleware.services/programaLealtadTypes">
	<wsdl:types>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
		</xsd:schema>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/programaLealtadTypes" schemaLocation="../../ProgramaLealtad/xsd/programaLealtadTypes.xsd"/>
		</xsd:schema>
	</wsdl:types>
	
	<wsdl:message name="consultaPuntosLealtadRequest">
		<wsdl:part element="pro:consultaPuntosLealtad" name="parameters"/>
		<wsdl:part name="RequestHeader" element="auth:RequestHeader"/>
	</wsdl:message>
	<wsdl:message name="consultaPuntosLealtadResponse">
		<wsdl:part element="pro:consultaPuntosLealtadResponse" name="result"/>
		<wsdl:part name="ResponseHeader" element="auth:ResponseHeader"/>
	</wsdl:message>
	
	<wsdl:portType name="consultaPuntosLealtadPS">
		<wsdl:operation name="consultaPuntosLealtad" parameterOrder="parameters RequestHeader ResponseHeader">
			<wsdl:input message="fic:consultaPuntosLealtadRequest"/>
			<wsdl:output message="fic:consultaPuntosLealtadResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	
	<wsdl:binding name="consultaPuntosLealtadPSSOAP" type="fic:consultaPuntosLealtadPS">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="consultaPuntosLealtad">
			<soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/consultaPuntosLealtadPS/consultaPuntosLealtad"/>
			<wsdl:input>
				<soap:body use="literal" parts="parameters"/>
				<soap:header message="fic:consultaPuntosLealtadRequest" part="RequestHeader" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" parts="result"/>
				<soap:header message="fic:consultaPuntosLealtadResponse" part="ResponseHeader" use="literal"/>
			</wsdl:output>
		</wsdl:operation>	
	</wsdl:binding>

	<wsdl:service name="consultaPuntosLealtadPS">
		<wsdl:port binding="fic:consultaPuntosLealtadPSSOAP" name="consultaPuntosLealtadPSSOAP">
	  		<soap:address location="http://172.23.13.19:8003/Middleware/SalesAndServices/BrandManagement/ConsultaPuntosLealtadMRS"/>
	   	</wsdl:port>
	</wsdl:service>

</wsdl:definitions>